roma-cezar/NRF5x_SDK12_GIT/bds_esp8266/main.c
/**
 * Copyright (c) 2015 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
/*
#include "service_if.h"
#include <stdint.h>
#include "ble_bas.h" 
#include "ble_water_meter.h" 
#include "ble_wlan_settings.h" 

#include "SEGGER_RTT.h"

ble_bas_t    m_bas; 
ble_water_meter_t    m_water_meter; 
ble_wlan_settings_t    m_wlan_settings; 

extern uint8_t SSID[32];
extern uint8_t PSWD[32];
*/
/** @file
 *
 * @defgroup ble_sdk_bluetooth_template_main main.c
 * @{
 * @ingroup bluetooth_template
 * @brief bluetooth_template main file.
 *
 * This file contains a template for creating a new application using Bluetooth Developper Studio generated code.
 * It has the code necessary to wakeup from button, advertise, get a connection restart advertising on disconnect and if no new
 * connection created go back to system-off mode.
 * It can easily be used as a starting point for creating a new application, the comments identified
 * with 'YOUR_JOB' indicates where and how you can customize.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "peer_manager.h"
#include "fds.h"
#include "fstorage.h"
#include "ble_conn_state.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "service_if.h"
//#define NRF_LOG_MODULE_NAME "APP"
//#include "nrf_log.h"
//#include "nrf_log_ctrl.h"
#include "nrf_ble_qwr.h"
#include "nrf_delay.h"

#if defined (NRF51822)
		#include "nrf51.h"
		#include "nrf51_bitfields.h"
#elif defined (NRF52832)
		#include "nrf52.h"
		#include "nrf52_bitfields.h"
#endif

#include "SEGGER_RTT.h"
#include "SEGGER_RTT_Conf.h"

#include "nrf_drv_gpiote.h"
#include "nrf_drv_rtc.h"

#include "service_if.h"
#include "ble_bas.h" 
#include "ble_water_meter.h"
#include "ble_wlan.h" 

#include "esp8266.h"
#include "FLASH.h"

#include "ff.h"
#include "diskio_blkdev.h"
#include "nrf_block_dev_sdc.h"

static FATFS fs;
static DIR dir;
static FILINFO fno;
static FIL file;
#define FILE_NAME   "LOG.TXT"

#define SDC_SCK_PIN     25  ///< SDC serial clock (SCK) pin.
#define SDC_MOSI_PIN    23  ///< SDC serial data in (DI) pin.
#define SDC_MISO_PIN    24  ///< SDC serial data out (DO) pin.
#define SDC_CS_PIN      22  ///< SDC chip select (CS) pin.

FRESULT ff_result;
DSTATUS disk_state = STA_NOINIT;		
NRF_BLOCK_DEV_SDC_DEFINE(
        m_block_dev_sdc,
        NRF_BLOCK_DEV_SDC_CONFIG(
                SDC_SECTOR_SIZE,
                APP_SDCARD_CONFIG(SDC_MOSI_PIN, SDC_MISO_PIN, SDC_SCK_PIN, SDC_CS_PIN)
         ),
         NFR_BLOCK_DEV_INFO_CONFIG("Nordic", "SDC", "1.00")
);

#define USER_RTC 2
#define COUNT_RTC_CC 0
#define TIMER_RTC_CC  1
#define COUNT_RTC_TICKS   (RTC_US_TO_TICKS(5000000ULL, RTC_DEFAULT_CONFIG_FREQUENCY)) // 5 sec
#define TIMER_RTC_TICKS    (RTC_US_TO_TICKS(100000ULL, RTC_DEFAULT_CONFIG_FREQUENCY)) // 0.1 sec
static nrf_drv_rtc_config_t const m_rtc_config = NRF_DRV_RTC_DEFAULT_CONFIG;
static nrf_drv_rtc_t const m_rtc = NRF_DRV_RTC_INSTANCE(USER_RTC);


uint8_t wlan_tcp_status = 0;
uint8_t get_request[256];
uint8_t sdc_log[256];
uint32_t counter1 = 0;
uint32_t counter2 = 0;

bool hot_water_notify_flag = false;
bool cold_water_notify_flag = false;
bool send_flag = false;
bool wlan_rdy_flag = false;

extern ble_water_meter_t    m_water_meter; 
extern ble_wlan_t    m_wlan; 
extern ble_bas_t    m_bas; 

ble_water_meter_hot_water_t 								m_water_meter_hot_water_characteristic;
ble_water_meter_cold_water_t  							m_water_meter_cold_water_characteristic;
ble_wlan_wlan_action_t											m_wlan_action_characteristic;
ble_wlan_wlan_ssid_t												m_wlan_ssid_characteristic;
ble_wlan_wlan_pass_t												m_wlan_pass_characteristic;

bool wlan_update_flag = false;
uint8_t SSID[16];
uint8_t PSWD[16];
uint16_t days = 0;
uint8_t hours = 0;
uint8_t minutes = 0;
uint8_t seconds = 0;
uint8_t mills = 0; // 1 imp 100 ms
uint8_t timestamp[32] = "day: 0 time: 00:00:00.0";

#define IS_SRVC_CHANGED_CHARACT_PRESENT  1                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/
#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE             GATT_MTU_SIZE_DEFAULT                      /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define CENTRAL_LINK_COUNT               0                                          /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT            1                                          /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME                      "Nordic_BDS"                               /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME                "NordicSemiconductor"                      /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                 200                                        /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       0                                        /**< The advertising timeout in units of seconds. */

