roma-cezar/NRF5x_SDK12_GIT/bds_esp8266/main.c
    if (erase_bonds)
    {
        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
    }

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = fds_register(fds_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
		
		nrf_gpio_pin_clear(17);
}

/**/
void GPIOTE_IRQHandler(void)
//void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
		if(NRF_GPIOTE->EVENTS_IN[0] == 1)
		{	
			NRF_GPIOTE->EVENTS_IN[0] = 0;
			counter1++;

		}
		if(NRF_GPIOTE->EVENTS_IN[1] == 1)
		{			
			NRF_GPIOTE->EVENTS_IN[1] = 0;
			counter2++;
		}	
//		if( ((~NRF_GPIO->IN) >> 13) & 0x01)
//		{					
//				nrf_gpio_pin_clear(17);
//				SEGGER_RTT_WriteString(0, "Adverttising started!\r\n");
//				uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
//				APP_ERROR_CHECK(err_code);
//		}
//		if( ((~NRF_GPIO->IN) >> 14) & 0x01 )
//		{						
//				nrf_gpio_pin_set(17);
//				SEGGER_RTT_WriteString(0, "Adverttising stopted!\r\n");
//				uint32_t err_code = sd_ble_gap_adv_stop();
//				APP_ERROR_CHECK(err_code);
//		}
}
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
		uint32_t err_code;
    bsp_event_t startup_event;
//    uint32_t err_code = bsp_init(NULL, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_event_handler);
//    APP_ERROR_CHECK(err_code);
//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
	
		nrf_gpio_cfg_output(17);
		nrf_gpio_cfg_output(18);
		nrf_gpio_cfg_output(19);
		nrf_gpio_cfg_output(20);
		nrf_gpio_pin_set(17);
		nrf_gpio_pin_set(18);
		nrf_gpio_pin_set(19);
		nrf_gpio_pin_set(20);
	
		nrf_gpio_cfg_input(3, GPIO_PIN_CNF_PULL_Pullup);
		nrf_gpio_cfg_input(4, GPIO_PIN_CNF_PULL_Pullup);
	
//		*(volatile uint32_t *)(NRF_GPIOTE_BASE + 0x600 + (4 * 0)) = 1;
//		*(volatile uint32_t *)(NRF_GPIOTE_BASE + 0x600 + (4 * 1)) = 1;
	
		NRF_GPIOTE->CONFIG[0] = GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos |
														3 << GPIOTE_CONFIG_PSEL_Pos												 |	
														GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos;
		
		NRF_GPIOTE->CONFIG[1] = GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos |
														4 << GPIOTE_CONFIG_PSEL_Pos												 |	
														GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos;	
	
		NRF_GPIOTE->EVENTS_IN[0] = 0;
		NRF_GPIOTE->EVENTS_IN[1] = 0;
	
		NRF_GPIOTE->INTENSET = GPIOTE_INTENSET_IN0_Enabled << GPIOTE_INTENSET_IN0_Pos | 
													 GPIOTE_INTENSET_IN1_Enabled << GPIOTE_INTENSET_IN1_Pos ; 
		//NRF_GPIOTE->POWER = 	GPIOTE_POWER_POWER_Enabled << GPIOTE_POWER_POWER_Pos;
		NVIC_SetPriority(2, GPIOTE_IRQn);
		NVIC_DisableIRQ(GPIOTE_IRQn);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}
/**/
static void rtc_handler(nrf_drv_rtc_int_type_t int_type)
{
	ret_code_t err_code;
	
	switch(int_type)
	{
		case NRF_DRV_RTC_INT_COMPARE0:
			nrf_gpio_pin_toggle(18);
					
			send_flag = true;
			err_code = nrf_drv_rtc_cc_set(
					&m_rtc,
					COUNT_RTC_CC,
					(nrf_rtc_cc_get(m_rtc.p_reg, COUNT_RTC_CC) + COUNT_RTC_TICKS) & RTC_COUNTER_COUNTER_Msk,
					true);
			APP_ERROR_CHECK(err_code);
			break;
		
		case NRF_DRV_RTC_INT_COMPARE1:
			nrf_gpio_pin_toggle(20);
		
			if(++mills == 10)
			{
				mills = 0;
				
				m_water_meter_hot_water_characteristic.meters_per_cube = counter1;
				ble_water_meter_hot_water_set(&m_water_meter, &m_water_meter_hot_water_characteristic);
				if(hot_water_notify_flag){
					ble_water_meter_hot_water_notify(&m_water_meter, &m_water_meter_hot_water_characteristic);
				}
				
				m_water_meter_cold_water_characteristic.meters_per_cube = counter2;
				ble_water_meter_cold_water_set(&m_water_meter, &m_water_meter_cold_water_characteristic);
				if(cold_water_notify_flag){
					ble_water_meter_cold_water_notify(&m_water_meter, &m_water_meter_cold_water_characteristic);
				}
				
				if(++seconds == 60)
				{
					seconds=0;
					if(++minutes == 60)
					{
						minutes = 0;
						if(++hours == 24)
						{
							days++;
							hours = 0;
						}
					}
				}
			}
			sprintf(timestamp, "day: %d time: %.2d:%.2d:%.2d", days, hours, minutes, seconds);
			err_code = nrf_drv_rtc_cc_set(
					&m_rtc,
					TIMER_RTC_CC,
					(nrf_rtc_cc_get(m_rtc.p_reg, TIMER_RTC_CC) + TIMER_RTC_TICKS) & RTC_COUNTER_COUNTER_Msk,
					true);
			APP_ERROR_CHECK(err_code);
			break;
	}
}
/**/
static bool SDC_LOG_INIT(void)
{
		uint8_t msg[128];
	    // Initialize FATFS disk I/O interface by providing the block device.
    static diskio_blkdev_t drives[] =
    {
            DISKIO_BLOCKDEV_CONFIG(NRF_BLOCKDEV_BASE_ADDR(m_block_dev_sdc, block_dev), NULL)
    };

    diskio_blockdev_register(drives, ARRAY_SIZE(drives));

    SEGGER_RTT_WriteString(0, "SDC: Initializing disk 0...\r\n");
    for (uint32_t retries = 10; retries && disk_state; --retries)
    {
        disk_state = disk_initialize(0);
    }
    if (disk_state)
    {
        SEGGER_RTT_WriteString(0, "SDC: Disk initialization failed\r\n");
        return 0;
    }
		else
		{
			nrf_gpio_pin_clear(19);
		}
    
    uint32_t blocks_per_mb = (1024uL * 1024uL) / m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_size;
    uint32_t capacity = m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_count / blocks_per_mb;
    
		
		sprintf(msg, "SDC: Capacity: %d MB\r\n", capacity);
		SEGGER_RTT_WriteString(0, msg);

    SEGGER_RTT_WriteString(0, "SDC: Mounting...\r\n");
    ff_result = f_mount(&fs, "", 1);
    if (ff_result)
    {
        SEGGER_RTT_WriteString(0, "SDC: Mount failed\r\n");
        return 0;
    }
		
		ff_result = f_opendir(&dir, "/");
    if (ff_result)
    {
        SEGGER_RTT_WriteString(0, "SDC: Directory listing failed!\r\n");
        return 0;
    }
		
		do
    {
        ff_result = f_readdir(&dir, &fno);
        if (ff_result != FR_OK)
        {
            SEGGER_RTT_WriteString(0, "SDC: Directory read failed\r\n");
            return 0;
        }
        
