roma-cezar/NRF5x_SDK12_GIT/bds_esp8266/main.c
        if (fno.fname[0])
        {
            if (fno.fattrib & AM_DIR)
            {
								sprintf(msg,	"SDC: <DIR> %s\r\n",(uint32_t)fno.fname);
								SEGGER_RTT_WriteString(0, msg);
            }
            else
            {
                sprintf(msg, "SDC: %.9lu  %s\r\n", fno.fsize, (uint32_t)fno.fname);
								SEGGER_RTT_WriteString(0, msg);
            }
        }
    }
    while (fno.fname[0]);
    SEGGER_RTT_WriteString(0, "\r\n");
		return 1;
}

/**/
static void SDC_LOG_CLEAR(void)
{
		ff_result = f_open(&file, FILE_NAME, FA_READ | FA_WRITE | FA_OPEN_EXISTING);
    ff_result = f_write(&file, "", strlen("") - 1, NULL);
    (void) f_close(&file);
}
/**/
static void SDC_LOG(uint8_t* data)
{
    uint32_t bytes_written;
    ff_result = f_open(&file, FILE_NAME,  FA_READ | FA_WRITE | FA_OPEN_APPEND);
    ff_result = f_write(&file, data, strlen(data) - 1, (UINT *) &bytes_written);
	  if (ff_result == FR_OK)
    {
			nrf_gpio_pin_toggle(19);
    }
    (void) f_close(&file);
}
/**/
static void rtc_setup(void)
{
	ret_code_t err_code;
	err_code = nrf_drv_rtc_init(&m_rtc, &m_rtc_config, rtc_handler);
	APP_ERROR_CHECK(err_code);
	err_code = nrf_drv_rtc_cc_set(&m_rtc, COUNT_RTC_CC, COUNT_RTC_TICKS, true);
	APP_ERROR_CHECK(err_code);
	err_code = nrf_drv_rtc_cc_set(&m_rtc, TIMER_RTC_CC, TIMER_RTC_TICKS, true);
	APP_ERROR_CHECK(err_code);
	nrf_drv_rtc_enable(&m_rtc);
	SEGGER_RTT_WriteString(0, "RTC started!\r\n");
}
/**@brief Function for application main entry.
 */

int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
	
		flash_read(FLASH_USER_START_ADDR, (uint32_t *)SSID, 4);
		flash_read(FLASH_USER_START_ADDR + 4, (uint32_t *)PSWD, 4);

	// Initialize.
    buttons_leds_init(&erase_bonds);
		ESP8266_Serial_Config(115200UL);
	
		SDC_LOG_INIT();
//		SDC_LOG_CLEAR();
	
    timers_init();
    ble_stack_init();
	
	  peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        SEGGER_RTT_WriteString(0, "Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start execution.
    application_timers_start();
    SEGGER_RTT_WriteString(0, "Bluetooth Dev Studio Start Advertising \r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
		
		// Prepare settings
		if(strcmp((const char*)SSID, "ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ")==0 && strcmp((const char*)PSWD, "ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ")==0 &&
			 strcmp((const char*)SSID, "")==0 								&& strcmp((const char*)PSWD, "")==0)
		{
			SEGGER_RTT_WriteString(0, "No SSID and PSWD in flash!\r\n");
			wlan_rdy_flag = false;
		}
		else
		{
			m_wlan_action_characteristic.action = 0;
			ble_wlan_wlan_action_set(&m_wlan, &m_wlan_action_characteristic);
			
			m_wlan_ssid_characteristic.ssid.p_str = SSID;
			m_wlan_ssid_characteristic.ssid.length = strlen(SSID);
			ble_wlan_wlan_ssid_set(&m_wlan, &m_wlan_ssid_characteristic);

			m_wlan_pass_characteristic.pass.p_str = PSWD;
			m_wlan_pass_characteristic.pass.length = strlen(PSWD);
			ble_wlan_wlan_pass_set(&m_wlan, &m_wlan_pass_characteristic);
			
			SEGGER_RTT_WriteString(0, (const char*)"SSID: ");
			SEGGER_RTT_WriteString(0, (const char*)SSID);
			SEGGER_RTT_WriteString(0, (const char*)"\r\nPASS: ");
			SEGGER_RTT_WriteString(0, (const char*)PSWD);
			SEGGER_RTT_WriteString(0, "\r\n");	
			wlan_rdy_flag = true;
		}
		
		counter1=0;
		counter2=0;
		rtc_setup();
		NVIC_EnableIRQ(GPIOTE_IRQn);
		// Main loop
    while(true)
    {
			if(wlan_update_flag)
			{
				
				SEGGER_RTT_WriteString(0, "Update WLAN settings...\r\n");	
				sd_flash_page_erase(127);
				nrf_delay_ms(20);
				sd_flash_write(FLASH_USER_START_ADDR,(uint32_t *)SSID, 4);
				nrf_delay_ms(20);		
				sd_flash_write(FLASH_USER_START_ADDR + 4,(uint32_t *)PSWD, 4);
				nrf_delay_ms(20);
				
				SEGGER_RTT_WriteString(0, (const char*)"SSID: ");
				SEGGER_RTT_WriteString(0, (const char*)SSID);
				SEGGER_RTT_WriteString(0, (const char*)"\r\nPASS: ");
				SEGGER_RTT_WriteString(0, (const char*)PSWD);
				SEGGER_RTT_WriteString(0, "\r\n");	
				
				m_wlan_action_characteristic.action = 0;
				ble_wlan_wlan_action_set(&m_wlan, &m_wlan_action_characteristic);
				
				m_wlan_ssid_characteristic.ssid.p_str = SSID;
				m_wlan_ssid_characteristic.ssid.length = strlen(SSID);
				ble_wlan_wlan_ssid_set(&m_wlan, &m_wlan_ssid_characteristic);
				
				m_wlan_pass_characteristic.pass.p_str = PSWD;
				m_wlan_pass_characteristic.pass.length = strlen(PSWD);
				ble_wlan_wlan_pass_set(&m_wlan, &m_wlan_pass_characteristic);
				
				wlan_update_flag = false;
				wlan_rdy_flag= true;
				
				wlan_tcp_status = ESP8266_Session_Status();
				if(wlan_tcp_status == 2)
				{
					ESP8266_Wlan_Stop();
				}
				else if(wlan_tcp_status == 3)
				{
					ESP8266_Session_Close();
					ESP8266_Wlan_Stop();
				}	
				SEGGER_RTT_WriteString(0, "WLAN settings updated!\r\n");	
			}
			if(send_flag && !wlan_update_flag)
			{		
//				sprintf(sdc_log, "\r\n%s counter1=%d\r\n", timestamp, counter1);
//				SEGGER_RTT_WriteString(0, sdc_log);
//				SDC_LOG(sdc_log);

//				sprintf(sdc_log, "%s counter2=%d\r\n\r\n", timestamp, counter2);
//				SEGGER_RTT_WriteString(0, sdc_log);
//				SDC_LOG(sdc_log);

				if(wlan_rdy_flag)
				{
					if(ESP8266_Preinit())
					{
						sprintf(sdc_log, "\r\n%s WLAN Init ok!\r\n", timestamp);
						SDC_LOG(sdc_log);
						if(ESP8266_Wlan_Start(SSID, PSWD))
						{
							sprintf(sdc_log, "%s WLAN Started! IP: %s\r\n", timestamp, ESP8266_Get_IP());
							SDC_LOG(sdc_log);
							wlan_tcp_status = ESP8266_Session_Status();

							sprintf(sdc_log, "%s WLAN Status: %d\r\n", timestamp, wlan_tcp_status);
							SDC_LOG(sdc_log);
							
							if(wlan_tcp_status == 2 || wlan_tcp_status == 4)
							{
								sprintf(sdc_log, "%s WLAN Opening session!\r\n", timestamp);
								SDC_LOG(sdc_log);
								
								if(ESP8266_Session_Open("SSL", "192.168.1.252", 9443))
								{
									sprintf(sdc_log, "%s WLAN Session opened!\r\n", timestamp);
									SDC_LOG(sdc_log);
									
