roma-cezar/NRF5x_SDK12_GIT/bds_esp8266/main.c
									wlan_tcp_status = ESP8266_Session_Status();
									if(wlan_tcp_status == 3)
									{
											sprintf(sdc_log, "%s WLAN Send data...\r\n", timestamp);
											SDC_LOG(sdc_log);
										
											memset(get_request, 0 , 256);
											sprintf(get_request, "/22dd4423c4a34bf5b989a6342cc691d6/update/V0?value=%d", counter1);
											if(ESP8266_GET_Req(get_request))
											{		
												sprintf(sdc_log, "%s WLAN Send data OK!\r\n", timestamp);
												SDC_LOG(sdc_log);
											}
											else
											{
												sprintf(sdc_log, "%s WLAN Send data ERROR!\r\n", timestamp);
												SDC_LOG(sdc_log);
											}
											
											
											sprintf(sdc_log, "%s WLAN Send data...\r\n", timestamp);
											SDC_LOG(sdc_log);
											
											memset(get_request, 0 , 256);
											sprintf(get_request, "/22dd4423c4a34bf5b989a6342cc691d6/update/V1?value=%d", counter2);
											if(ESP8266_GET_Req(get_request))
											{		
												sprintf(sdc_log, "%s WLAN Send data OK!\r\n", timestamp);
												SDC_LOG(sdc_log);
											}
											else
											{
												sprintf(sdc_log, "%s WLAN Send data ERROR!\r\n", timestamp);
												SDC_LOG(sdc_log);
											}
											sprintf(sdc_log, "%s WLAN Closing Session...\r\n", timestamp);
											SDC_LOG(sdc_log);
											if(ESP8266_Session_Close())
											{
												sprintf(sdc_log, "%s WLAN Session closed!\r\n", timestamp);
												SDC_LOG(sdc_log);
											}
											else
											{
												sprintf(sdc_log, "%s WLAN Session closing error!\r\n", timestamp);
												SDC_LOG(sdc_log);
											}
										}
									}
								}
							}
							
							sprintf(sdc_log, "%s WLAN Stoping...\r\n", timestamp);
							SDC_LOG(sdc_log);
							
							wlan_tcp_status = ESP8266_Session_Status();
							if(wlan_tcp_status != 5)
							{
								if(ESP8266_Wlan_Stop())
								{
									sprintf(sdc_log, "%s WLAN Stopted!\r\n", timestamp);
									SDC_LOG(sdc_log);
								}
								else
								{
									sprintf(sdc_log, "%s WLAN Stop error!\r\n", timestamp);
									SDC_LOG(sdc_log);
								}	
							}
					}					
				}
				send_flag = !send_flag;
			}
			power_manage();
    }
}

void HardFault_Handler(void)
{
	SEGGER_RTT_WriteString(0, (const char*)"\r\nHard fault!\r\n");
	sprintf(sdc_log, "%s Hard fault!\r\n", timestamp);
	SDC_LOG(sdc_log);
}
/**
 * @}
 */
